app/views/friendships/index.html.erb

		<%else%>
			<%chk=Friendship.where(friend_id:2,status: "Accepted") %>
---
SELECT "friendships".* FROM "friendships"  WHERE "friendships"."friend_id" = 1 AND "friendships"."status" = 'Accepted'