app/controllers/friendships_controller.rb

  def index


    @user = User.find(session[:user_id])
    @friends = @user.friends
    @user_all = User.all
    @friendship_all = Friendship.all
    @invites = Friendship.where(friend_id:session[:user_id], status: "Pending")
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
SELECT "friendships".* FROM "friendships"
SELECT "friendships"."user_id" FROM "friendships"  WHERE "friendships"."friend_id" = 2 AND "friendships"."status" = 'Accepted'

  def create
    $sid= params[:sid]
    Friendship.create(user: User.find(session[:user_id]), friend: User.find(params[:user_id]), status:"Pending")
---
INSERT INTO "friendships" ("created_at", "friend_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-11-07 21:10:32.501797"], ["friend_id", 2], ["status", "Pending"], ["updated_at", "2016-11-07 21:10:32.501797"], ["user_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def destroy #bidirectional deletion
   Friendship.find_by(user_id: User.find(session[:user_id]), friend_id: User.find(params[:user_id])).destroy
---
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."user_id" = 1 AND "friendships"."friend_id" = 2 LIMIT 1

  def accept #bidirectional addition
    $sac=params[:sac]
    @user = User.find(session[:user_id])
    Friendship.find_by(id: params[:id]).update(status:"Accepted")
    Friendship.create(user: @user , friend: User.find(params[:user_id]), status:"Accepted")
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."id" = 1 LIMIT 1
UPDATE "friendships" SET "status" = ?, "updated_at" = ? WHERE "friendships"."id" = 1  [["status", "Accepted"], ["updated_at", "2016-11-07 21:11:01.409459"]]
INSERT INTO "friendships" ("created_at", "friend_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-11-07 21:11:01.560020"], ["friend_id", 1], ["status", "Accepted"], ["updated_at", "2016-11-07 21:11:01.560020"], ["user_id", 2]]

  def ignore
    Friendship.find_by(id: params[:id]).destroy
---
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 9]]
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."id" = 9 LIMIT 1