app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "description", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def register
	  	@user = User.create(name:params[:name],email:params[:email],password:params[:password],password_confirmation:params[:password_confirmation], description:params[:description])

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'ankushmalik631@gmail.com' LIMIT 1
---
  def login
  		if !params[:email].blank? && !params[:password].blank?
  		user = User.find_by_email(params[:email])

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "friendships".* FROM "friendships"  WHERE "friendships"."status" = 'Pending' AND "friendships"."friend_id" = 1
---
   def show_all
    @users = User.all
    @current_user = User.find(session[:user_id])
    @friendships = @current_user.friends
    @pending = Friendship.where(status: "Pending", friend_id:session[:user_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
  @user= User.find(params[:user_id])